test/granular/single/constant_velocity/openfoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (0.1 0 0)
    (0.1 10.0 0)
    (0 10.0 0)
    (0 0 0.1)
    (0.1 0 0.1)
    (0.1 10.0 0.1)
    (0 10.0 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    wall
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (4 5 6 7)
            (0 3 2 1)
        );  
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
